GREETING_LINE = "Здравствуйте! Данный сервис предоставляет данные о погоде в любой точке мира\n"
INFO_LINE = "Вам доступен следюущий функционал:\n" \
            "Для получения сведений о погоде в населенном введите его название\n" \
            "Для получения сведений о погоде по вашему местоположению введите \"Мое местоположение\"\n" \
            "Для вывода истории запросов введите \"Показать историю\"\n" \
            "Для очистки истории запросов введите \"Очистить историю\"\n" \
            "Для выхода введите \"Выход\"\n" \
            "Для получения справки введите \"Справка\"\n"
NUMBER_OF_HISTORY_LINE = "Сколько последних запросов вы хотите посмотреть?"
INVITING_LINE = "Введите ваш запрос"
WRONG_INPUT_LINE = "Вы ввели некорректный запрос. Пожалуйста, попробуйте еще раз"
NO_CONNECTION_LINE = "Кажется, вы не подключены к сети. Проверьте подключение и повторите попытку"
EMPTY_INPUT_LINE = "Пожалуйста, введите запрос"
UNKNOWN_ERROR_LINE = "Что-то пошло не так. Попробуйте повторить ваш запрос"
UNKNOWN_GEOLOCATION_LINE = "Не получается определить ваше местонахождение. Проверьте подключение к сети или повторите попытку позже"
FAILED_API_REQUEST_LINE = "Не удается получить информацию о погоде. Повторите попытку позже"
